DropletSpreadingTest/ZeroG/case/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0 0 0)
    (@!X!@ 0 0)
    (@!X!@ @!X!@ 0)
    (0 @!X!@ 0)
    (0 0 @!Z!@)
    (@!X!@ 0 @!Z!@)
    (@!X!@ @!X!@ @!Z!@)
    (0 @!X!@ @!Z!@)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (@!nx!@ @!nx!@ @!nz!@) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    front
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    back
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom 
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

);

mergePatchPairs
(
);


// ************************************************************************* //
